[{"thoiGianDienRa":"938","ten":"Ngô Quyền xưng vương, đóng đô ở Cổ Loa"},{"thoiGianDienRa":"965-967","ten":"Loạn 12 sứ quân."},{"thoiGianDienRa":"968","ten":"Đinh Bộ Lĩnh dẹp \"Loạn 12 sứ quân\"."},{"thoiGianDienRa":"968-980","ten":"Đinh Bộ Lĩnh lên ngôi vua, đặt tên nước là Đại Cồ Việt, đóng đô ở Hoa Lư"},{"thoiGianDienRa":"981","ten":"Lê Hoàn đánh bại quân Tống"},{"thoiGianDienRa":"981-1009","ten":"Lê Hoàn lên ngôi, lập nhà Tiền Lê, đóng đô ở Hoa Lư"},{"thoiGianDienRa":"1009","ten":"Lý Công Uẩn lên ngôi, lập ra nhà Lý"},{"thoiGianDienRa":"1010","ten":"Lý Thái Tổ dời đô về Đại la, đổi tên thành Thăng Long"},{"thoiGianDienRa":"1042","ten":"Nhà Lý ban hành Hình thư"},{"thoiGianDienRa":"1054","ten":"Nhà Lý đổi tên nước thành Đại Việt."},{"thoiGianDienRa":"1070","ten":"Nhà Lý lập Văn Miếu thờ Khổng Tử"},{"thoiGianDienRa":"1076","ten":"Lập Quốc Tử Giám ở kinh đô Thăng Long"},{"thoiGianDienRa":"1077","ten":"Lý Thường Kiệt lãnh đạo kháng chiến chống Tống thắng lợi"},{"thoiGianDienRa":"1226","ten":"Trần Cảnh lên ngôi vua lập ra nhà Trần"},{"thoiGianDienRa":"1230","ten":"nhà Trần ban hành Quốc triều hình luật"},{"thoiGianDienRa":"1253","ten":"Lập Quốc học viện và Giảng võ đường"},{"thoiGianDienRa":"1258","ten":"Chiến thắng quân xâm lược Mông Cổ lần thứ nhất"},{"thoiGianDienRa":"1285","ten":"Chiến thắng quân Nguyên lần hai"},{"thoiGianDienRa":"1288","ten":"Chiến thắng quân Nguyên lần ba"},{"thoiGianDienRa":"1400","ten":"Hồ Quý Ly lật đổ nhà Trần, lập nên nhà Hồ."},{"thoiGianDienRa":"1401","ten":"Định quan chế và hành luật của nước Đại Ngu."},{"thoiGianDienRa":"1406","ten":"Hơn 20 vạn quân Minh kéo vào xâm lược nước ta."},{"thoiGianDienRa":"1407","ten":"Cuộc kháng chiến của nhà Hồ thất bại."},{"thoiGianDienRa":"1418","ten":"Cuộc khởi nghĩa Lam Sơn, do Lê Lợi lãnh đạo, bùng nổ."},{"thoiGianDienRa":"1427","ten":"Cuộc khởi nghĩa Lam Sơn thắng lợi."},{"thoiGianDienRa":"1428","ten":"Lê Lợi lên ngôi vua ở Đông Đô, đặt lại quốc hiệu Đại Việt."},{"thoiGianDienRa":"1442","ten":"Khoa thi hội đầu của nhà Lê được tổ chức."},{"thoiGianDienRa":"1483","ten":"Lê Thánh Tông biên soạn và ban hành bộ luật Hồng Đức."},{"thoiGianDienRa":"1511","ten":"Khởi nghĩa Trần Tuân."},{"thoiGianDienRa":"1516","ten":"Khởi nghĩa Trần Cảo."},{"thoiGianDienRa":"1527","ten":"Mạc Đăng Dung lật đổ nhà Lê Sơ, thành lập nhà Mạc."},{"thoiGianDienRa":"1543-1592","ten":"Thời kỳ Lê-Mạc và chiến tranh Nam-Bắc triều."},{"thoiGianDienRa":"1592","ten":"Nhà Mạc sụp đổ."},{"thoiGianDienRa":"1627-1672","ten":"Chiến tranh Trịnh-Nguyễn, đất nước bị chia cắt thành 2 vùng."},{"thoiGianDienRa":"1739-1769","ten":"Khởi nghĩa Hoàng Công Chất."},{"thoiGianDienRa":"1740-1751","ten":"Khởi nghĩa Nguyễn Danh Phương."},{"thoiGianDienRa":"1741-1751","ten":"Khởi nghĩa Nguyễn Hữu Châu."},{"thoiGianDienRa":"1771","ten":"Khởi nghĩa nông dân Tây Sơn bùng nổ, do ba anh em Nguyễn Nhạc, Nguyễn Huệ, Nguyễn Lữ lãnh đạo."},{"thoiGianDienRa":"1777","ten":"Nghĩa quân Tây Sơn lật đổ chính quyền chúa Nguyễn ở Đàng Trong."},{"thoiGianDienRa":"1785","ten":"Nguyễn Huệ chỉ huy quân Tây Sơn tiêu diệt 5 vạn quân Xiêm ở Rạch Gầm - Xoài Mút."},{"thoiGianDienRa":"1786","ten":"Nghĩa quân Tây Sơn tiến ra Bắc, lật độ chính quyền chúa Trịnh."},{"thoiGianDienRa":"1789","ten":"Vua Quang Trung đại phá 29 vạn quân Thanh."},{"thoiGianDienRa":"1789-1792","ten":"Chính quyền của Quang Trung thực thi nhiều chính sách cải cách tiến bộ."},{"thoiGianDienRa":"1792","ten":"Quang Trung đột ngột qua đời."},{"thoiGianDienRa":"1802","ten":"Nguyễn Ánh lên ngôi, nhà Nguyễn thành lập."},{"thoiGianDienRa":"1804","ten":"Vua Gia Long đặt quốc hiệu là Việt Nam, kinh đô đóng ở Phú Xuân (Huế)."},{"thoiGianDienRa":"1815","ten":"Ban hành bộ Hoàng triều luật lệ (Bộ luật Gia Long)."},{"thoiGianDienRa":"1820","ten":"Minh Mạng lên ngôi hoàng đế."},{"thoiGianDienRa":"1821-1827","ten":"Khởi nghĩa Phan Bá Vành."},{"thoiGianDienRa":"1831-1832","ten":"Nhà Nguyễn thời Minh Mạng sắp xếp lại đơn vị hành chính trong cả nước."},{"thoiGianDienRa":"1833-1835","ten":"Khởi nghĩa Lê Văn Khôi."},{"thoiGianDienRa":"1838","ten":"Quốc hiệu Đại Nam."},{"thoiGianDienRa":"1854-1856","ten":"Khởi nghĩa Cao Bá Quát."},{"thoiGianDienRa":"1858","ten":"Thực dân Pháp nổ súng xâm lược Việt Nam tại bán đảo Sơn Trà-Đà Nẵng."},{"thoiGianDienRa":"5/6/1911","ten":"Nguyễn Tất Thành ra đi tìm đường cứu nước"},{"thoiGianDienRa":"6/1919","ten":"Nguyễn Ái Quốc gửi đến Hội nghị Vécxai bản yêu sách của nhân dân An Nam"},{"thoiGianDienRa":"1919","ten":"Phong trào chấn hưng nội hóa, bài trừ ngoại hóa của giai cấp tư sản dân tộc"},{"thoiGianDienRa":"1920","ten":"Công dân Sài Gòn – Chợ Lớn thành lập Công hội đỏ"},{"thoiGianDienRa":"7/1920","ten":"Nguyễn Ái Quốc đọc Sơ thảo lần thứ nhất những luận cương về vấn đề dân tộc và thuộc địa của V.I.Lenin"},{"thoiGianDienRa":"12/1920","ten":"Nguyễn Ái Quốc bỏ phiếu tàn thành gia nhập Quốc tế Cộng sản và tham gia sáng lập Đảng cộng sản Pháp"},{"thoiGianDienRa":"1921","ten":"Thành lập Hội Liên hiệp thuộc địa ở Pari, báo Người cùng khổ là cơ quan ngôn luận"},{"thoiGianDienRa":"1922","ten":"– Công nhân viên chức sở Công thương Bắc kì đòi nghỉ ngày chủ nhật có trả lương – Bãi công của công nhân dệt, rượu, xay xát gạo ở Nam Định, Hải Dương, Hà Nội"},{"thoiGianDienRa":"1921 – 1923","ten":"Ra đời các tờ báo Nhân đạo, Đời sống công Nhân…"},{"thoiGianDienRa":"1923","ten":"Phong trào chống độc quyền cảng Sài Gòn và xuất khẩu lúa gạo nam Kì"},{"thoiGianDienRa":"6/1923","ten":"Nguyễn Ái Quốc dự Đại hội Quốc tế nông dân ở Liên Xô và được bầu vào BCH của Hội"},{"thoiGianDienRa":"1923 – 1924","ten":"Ra đời các tờ báo Sự thật, tạp chí thư tín quốc tế"},{"thoiGianDienRa":"11/11/1924","ten":"Nguyễn Ái Quốc đến Quảng Châu để đào tạo cán bộ, xây dựng tổ chức cách mạng và truyền bá lí luận cách mạng GPDT vào Việt Nam"},{"thoiGianDienRa":"8/1925","ten":"Công nhân thợ máy xưởng Ba Son đấu tranh, đánh dấu bước tiến mới của phong trào công nhân"},{"thoiGianDienRa":"1925","ten":"Bản án chế độ thực dân Pháp ra đời"},{"thoiGianDienRa":"Thời gian","ten":"Nội dung sự kiện"},{"thoiGianDienRa":"2/1925","ten":"Thành lập Cộng Sản đoàn"},{"thoiGianDienRa":"6/1925","ten":"Thành lập Hội Việt Nam Cách mạng Thanh niên"},{"thoiGianDienRa":"21/6/1925","ten":"Ra đời báo Thanh Niên"},{"thoiGianDienRa":"1926 – 1927","ten":"Bãi công của công nhân nhà máy sợi Nam Định, công nhân đồn điền Cao su Cam Tiêm, Phú Riềng"},{"thoiGianDienRa":"1927","ten":"Các bài giảng của Nguyễn Ái Quốc in thành sách Đường Kách Mệnh"},{"thoiGianDienRa":"25/12/1927","ten":"Thành lập Việt Nam quốc dân đảng"},{"thoiGianDienRa":"Cuối 1928","ten":"Phong trào vô sản hóa của Hội Việt Nam Cách mạng Thanh niên"},{"thoiGianDienRa":"2/1929","ten":"Tổ chức ám sát tên trùm mộ phu Badanh ở Hà Nội"},{"thoiGianDienRa":"3/1929","ten":"Một số hội viên tiên tiến của Hội Việt Nam Cách mạng Thanh niên lập ra chi bộ Cộng sản đầu tiên ở Bắc Kì"},{"thoiGianDienRa":"5/1929","ten":"Hội Việt Nam Cách mạng Thanh niên có cơ sở khắp cả nước"},{"thoiGianDienRa":"17/6/1929","ten":"Đông Dương Cộng sản đảng được thành lập"},{"thoiGianDienRa":"8/1929","ten":"Thành lập An Nam cộng sản đảng"},{"thoiGianDienRa":"9/1929","ten":"Thành lập Đông Dương cộng sản Liên đoàn"},{"thoiGianDienRa":"11/1929","ten":"An Nam Cộng sản Đảng họp Đại hội bầu ra BCH Trung ương"},{"thoiGianDienRa":"1928 – 1929","ten":"Cả nước có khoảng 40 cuộc bãi công của công nhân"},{"thoiGianDienRa":"06/01 – 8/2/1930","ten":"Hội nghị hợp nhất ba tổ chức cộng sản tại Hương Cảng (TQ)"},{"thoiGianDienRa":"9/2/1930","ten":"Khởi nghĩa Yên Bái bùng nổ"},{"thoiGianDienRa":"24/2/1930","ten":"Đông Dương Cộng sản Liên đoàn xin gia nhập ĐCSVN"},{"thoiGianDienRa":"3/2/1930","ten":"Lấy làm ngày kỉ niệm thành lập ĐCSVN"},{"thoiGianDienRa":"2/1930","ten":"Chính cương vắn tắt, sách lược vắn tắt được hội nghị thông qua"},{"thoiGianDienRa":"Thời gian","ten":"Nội dung sự kiện"},{"thoiGianDienRa":"1/5/1930","ten":"Nhiều cuộc đấu tranh nổ ra khắp cả nước nhân ngày Quốc tế lao động"},{"thoiGianDienRa":"12/9/1930","ten":"Cuộc biểu tình của 8000 nông dân huyện Hưng Nguyên"},{"thoiGianDienRa":"9/1930","ten":"Xô viết ra đời ở Nghệ An"},{"thoiGianDienRa":"Cuối 1930 đầu 1931","ten":"Xô viết ra đời ở Hà Tĩnh"},{"thoiGianDienRa":"10/1930","ten":"Luận Cương chính trị tháng 10 – Trần Phú"},{"thoiGianDienRa":"Thời gian","ten":"Nội dung sự kiện"},{"thoiGianDienRa":"3/1935","ten":"Đại hội đại biểu lần thứ nhất tại Ma Cao (Trung Quốc)"},{"thoiGianDienRa":"7/1935","ten":"Quốc tế cộng sản tiến hành đại hội lần VII"},{"thoiGianDienRa":"6/1936","ten":"Mặt trận nhân dân Pháp lên cầm quyền"},{"thoiGianDienRa":"7/1936","ten":"Hội nghị Ban Chấp hành Trung ương Đảng lần II họp tại Thượng Hải (TQ)"},{"thoiGianDienRa":"11/1936","ten":"Mặt trận thống nhất nhân dân phản đế Đông Dương ra đời"},{"thoiGianDienRa":"3/1938","ten":"Mặt trận thống nhất dân chủ Đông Dương (gọi tắt là Mặt trận dân chủ Đông Dương)"},{"thoiGianDienRa":"Thời gian","ten":"Nội dung sự kiện"},{"thoiGianDienRa":"11/1939","ten":"Hội nghị Ban Chấp hành Trung ương Đảng lần VI (Bà Điểm – Hóc Môn)"},{"thoiGianDienRa":"22/9/1940","ten":"Nhật vào Việt Nam"},{"thoiGianDienRa":"11/1940","ten":"Hội nghị Ban Chấp hành Trung ương Đảng lần VII họp ở Ba Đình, Bắc Ninh"},{"thoiGianDienRa":"28/1/1941","ten":"Nguyễn Ái Quốc về nước trực tiếp lãnh đạo cách mạng Việt Nam"},{"thoiGianDienRa":"10 – 19/5/1941","ten":"Hội nghị Ban Chấp hành Trung ương Đảng lần VIII tạo Pác Bó, Cao Bằng"},{"thoiGianDienRa":"19/5/1941","ten":"Mặt trận Việt Minh ra đời"},{"thoiGianDienRa":"1941","ten":"– Việt Nam Cứu quốc quân ra đời – Thành lập Trung đội cứu quốc quân I và II"},{"thoiGianDienRa":"1943","ten":"– Đảng đề ra Đề cương văn hóa Việt Nam; thành lập Hội Văn hóa cứu quốc – Việt Minh liên tỉnh Cao – Bắc – Lạng đẩy mạnh hoạt động; 19 ban xung phong “Nam tiến” ra đời"},{"thoiGianDienRa":"25 – 28/2/1943","ten":"Ban Thường vụ Trung ương Đảng họp ở Võng La (Hà Nội) vạch ra kế hoạch chuẩn bị khởi nghĩa vũ trang"},{"thoiGianDienRa":"1944","ten":"Hội Văn Hóa cứu quốc và Đảng dân chủ Việt Nam ra đời đứng trong hàng ngũ Việt Minh"},{"thoiGianDienRa":"25/2/1944","ten":"Trung đội Cứu quốc quân III ra đời"},{"thoiGianDienRa":"7/5/1944","ten":"Tổng bộ Việt Minh ra chỉ thị các cấp sửa soạn khởi nghĩa"},{"thoiGianDienRa":"22/12/1944","ten":"Thành lập đội Việt Nam Tuyên truyền Giải phóng quân"},{"thoiGianDienRa":"9/3/1945","ten":"Nhật đảo chính Pháp"},{"thoiGianDienRa":"12/3/1945","ten":"Ban Thường vụ Trung ương Đảng ra chỉ thị “Nhật – Pháp bắn nhau và hành động của chúng ta”"},{"thoiGianDienRa":"15 – 20/4/1945","ten":"Ban Thường vụ Trung ương Đảng triệu tập Hội nghị Quân sự cách mạng Bắc Kì"},{"thoiGianDienRa":"16/4/1945","ten":"Tổng bộ Việt Minh ra chỉ thị thành lập Ủy ban Dân tộc giải phóng các cấp"},{"thoiGianDienRa":"15/5/1945","ten":"Hồ Chí Minh chọn Tân Trào làm trung tâm chỉ đạo cách mạng"},{"thoiGianDienRa":"4/6/1945","ten":"Khu giải phóng Việt Bắc ra đời"},{"thoiGianDienRa":"13/8/1945","ten":"Trung ương Đảng và Tổng bộ Việt Minh thành lập Ủy ban khởi nghĩa toàn quốc và ban bố Quân lệnh số 1"},{"thoiGianDienRa":"14 – 15/8/1945","ten":"Hội nghị toàn quốc của Đảng họp ở Tân Trào (Tuyên Quang)"},{"thoiGianDienRa":"16 – 17/8/1945","ten":"Đại hội quốc dân ở Tân Trào tán thành chủ trương Tổng khởi nghĩa của Đảng; thông qua 10 chính sách của Việt Minh; cử ra Ủy ban GPDT Việt Nam"},{"thoiGianDienRa":"16/8/1945","ten":"Một đơn vị giải phóng quân về giải phóng thị xã Thái Nguyên"},{"thoiGianDienRa":"18/8/1945","ten":"Nhân dân Bắc Giang, Hải Dương, Hà Tĩnh, Quảng Nam giành chính quyền ở tỉnh lị"},{"thoiGianDienRa":"19/8/1945","ten":"Hà Nội giành chính quyền"},{"thoiGianDienRa":"23/8/1945","ten":"Huế giành chính quyền"},{"thoiGianDienRa":"25/8/1945","ten":"Sài Gòn giành chính quyền"},{"thoiGianDienRa":"28/8/1945","ten":"Tổng khởi nghĩa giành chính quyền trong cả nước"},{"thoiGianDienRa":"30/8/1945","ten":"Vua Bảo Đại thoái vị, chế độ phong kiến Việt Nam sụp đổ"},{"thoiGianDienRa":"2/9/1945","ten":"Tại Quảng trường Ba Đình (Hà Nội), Hồ Chủ Tịch đọc bản Tuyên ngôn Độc lập; khai sinh nước Việt Nam dân chủ Cộng hòa"}]